In [1]:
###                     PANDAS
# it is mejorly used for data set or data manupulation
# to generate a data frame or generate a conclusion on the behalf of data frame
# to do EDA (exploratory data analysis)
# EDA is a graphical representative

In [7]:
##                 SERIES
import pandas as pd
import numpy as np

names = pd.Series(['Umair','Noman','Talha','Salman'])# indexing will start automatically from zero
print(names,'\n')
names[1]="Noman Aijaz"
print(names)

ages = pd.Series([24,23,18,16],index=[4,3,2,1]) # index can be defined manually
print(ages,'\n')


noman = pd.Series({'ID':38,'Name':'Noman Aijaz','Father Name':'Aijaz Ahmed'})
print(noman)
noman.name = "Noman" # saves whole data name as Noman
noman.index.name="S.No" # making a heading of index as S.No
print(noman)

0     Umair
1     Noman
2     Talha
3    Salman
dtype: object

0          Umair
1    Noman Aijaz
2          Talha
3         Salman
dtype: object
4    24
3    23
2    18
1    16
dtype: int64

ID                      38
Name           Noman Aijaz
Father Name    Aijaz Ahmed
dtype: object
S.No
ID                      38
Name           Noman Aijaz
Father Name    Aijaz Ahmed
Name: Noman, dtype: object

In [23]:
#          OPERATION IN SERIES

import numpy as np

num = pd.Series([2,4,5,6,7,8,9,0,3])
print( "Smaller than 6 in array\n", num[num<6],"\n") # prints smaller than 6

print( "Greater than 5 in array\n", num[num>5],"\n") # prints greater than 5

print(num*2,'\n') # multiplies array by 2

print(num/2,'\n') # divides array by 2

print(np.sqrt(num),'\n')

print(np.exp(num),'\n')

print(10 in num) # checks whether 10 is in the list??

Smaller than 6 in array
 0    2
1    4
2    5
7    0
8    3
dtype: int64

Greater than 5 in array
 3    6
4    7
5    8
6    9
dtype: int64

0     4
1     8
2    10
3    12
4    14
5    16
6    18
7     0
8     6
dtype: int64

0    1.0
1    2.0
2    2.5
3    3.0
4    3.5
5    4.0
6    4.5
7    0.0
8    1.5
dtype: float64

0    1.414214
1    2.000000
2    2.236068
3    2.449490
4    2.645751
5    2.828427
6    3.000000
7    0.000000
8    1.732051
dtype: float64

0       7.389056
1      54.598150
2     148.413159
3     403.428793
4    1096.633158
5    2980.957987
6    8103.083928
7       1.000000
8      20.085537
dtype: float64

False

In [20]:
##                       DATAFRAME
# USNING DICTIONARIES
import pandas as pd
weather = pd.DataFrame({
    "DAY":[1,2,3,4,5],
    "TEMPERATURE":[16,17,14,18,15],
    "WIND SPEED":[30,32,29,31,33],
    "RAIN":['Yes','No','Yes','Yes','No']
})
weather.to_excel("weather.xlsx",sheet_name="sheet1")
weather[['DAY','TEMPERATURE']] # Accessing 2 columns 

weather.columns # shows the names of column

DAY              3
TEMPERATURE     14
WIND SPEED      29
RAIN           Yes
Name: 2, dtype: object

In [33]:
#USING TUPLES
courses= pd.DataFrame([
    (38,'Noman','Aijaz'),
    (26,'Muddasir','Khuwaja'),
    (36,'Shahreyar','Khan')
],columns=['ID','FIRST NAME','LAST NAME'])
courses

   ID FIRST NAME LAST NAME
0  38      Noman     Aijaz
1  26   Muddasir   Khuwaja
2  36  Shahreyar      Khan

In [1]:
#USING LISTS
import pandas as pd
students= pd.DataFrame([
    {'ID':38,'FIRST NAME':'Noman','LAST NAME':'Aijaz'},
    {'ID':26,'FIRST NAME':'Muddasir','LAST NAME':'Khuwaja'},
    {'ID':36,'FIRST NAME':'Shahreyar','LAST NAME':'Khan'}

])
students

   ID FIRST NAME LAST NAME
0  38      Noman     Aijaz
1  26   Muddasir   Khuwaja
2  36  Shahreyar      Khan

In [19]:
##                READING AN EXCEL FILE

file = pd.read_excel('weather.xlsx') # syntax for reading a file
file

#For CSV files
#file = pd.raed_csv('name.csv') # syntax for reading a csv file
#file

   Unnamed: 0  DAY  TEMPERATURE  WIND SPEED RAIN
0           0    1           16          30  Yes
1           1    2           17          32   No
2           2    3           14          29  Yes
3           3    4           18          31  Yes
4           4    5           15          33   No

In [21]:
weather

   DAY  TEMPERATURE  WIND SPEED RAIN
0    1           16          30  Yes
1    2           17          32   No
2    3           14          29  Yes
3    4           18          31  Yes
4    5           15          33   No

In [22]:
weather.head(2) # syntax for accessing desired number of rows from starting

   DAY  TEMPERATURE  WIND SPEED RAIN
0    1           16          30  Yes
1    2           17          32   No

In [23]:
weather.tail(2) # syntax for accessing desired number of rows from ending

   DAY  TEMPERATURE  WIND SPEED RAIN
3    4           18          31  Yes
4    5           15          33   No

In [24]:
weather['TEMPERATURE'].max() # shows the highest temperature from the table

18

In [25]:
weather['TEMPERATURE'].min() # shows the lowest temperature from the table

14

In [26]:
weather['TEMPERATURE'].mean() # shows the average temperature of the table

16.0

In [27]:
weather.describe() # shows the statistics of the table(only of numeric data)

            DAY  TEMPERATURE  WIND SPEED
count  5.000000     5.000000    5.000000
mean   3.000000    16.000000   31.000000
std    1.581139     1.581139    1.581139
min    1.000000    14.000000   29.000000
25%    2.000000    15.000000   30.000000
50%    3.000000    16.000000   31.000000
75%    4.000000    17.000000   32.000000
max    5.000000    18.000000   33.000000

In [28]:
weather.loc[2] #shows the data of given row

DAY              3
TEMPERATURE     14
WIND SPEED      29
RAIN           Yes
Name: 2, dtype: object

In [2]:
students

   ID FIRST NAME LAST NAME
0  38      Noman     Aijaz
1  26   Muddasir   Khuwaja
2  36  Shahreyar      Khan

In [3]:
students.T # syntax for transpose(rows will become column and column will become rows)

                0         1          2
ID             38        26         36
FIRST NAME  Noman  Muddasir  Shahreyar
LAST NAME   Aijaz   Khuwaja       Khan

In [8]:
students.index.name='YEAR' # naming the index
students.columns.name='DATA' # naming the column
students

DATA  ID FIRST NAME LAST NAME
YEAR
0     38      Noman     Aijaz
1     26   Muddasir   Khuwaja
2     36  Shahreyar      Khan

In [9]:
students[['FIRST NAME','LAST NAME']][students['ID']==38] # shows the first name and last name of ID 38

DATA FIRST NAME LAST NAME
YEAR
0         Noman     Aijaz

In [12]:
students[students['ID']>30] # shows the data of those students whose ID >30

DATA  ID FIRST NAME LAST NAME
YEAR
0     38      Noman     Aijaz
2     36  Shahreyar      Khan

In [14]:
students.shape # shows the number of rows and columns

(3, 3)

In [15]:
row,column=students.shape # syntax for individual number of row or column
row

3

In [16]:
students.sort_values(by='ID') # sort the data according to ID

DATA  ID FIRST NAME LAST NAME
YEAR
1     26   Muddasir   Khuwaja
2     36  Shahreyar      Khan
0     38      Noman     Aijaz

In [18]:
#                      SLICING
students[:2] # shows the data between given index

DATA  ID FIRST NAME LAST NAME
YEAR
0     38      Noman     Aijaz
1     26   Muddasir   Khuwaja

In [28]:
import pandas as pd
import numpy as np

# index=pd.date_range('20190804',periods=4) (assigning index numbers as dates and giving it a period of 4 days)
#columns=list('ABCD') (assigning column name into list because list writes each alphabate of string separately)

random1=pd.DataFrame(np.random.randn(4,4), index=pd.date_range('20190804',periods=4), columns=list('ABCD'))
print(random1)

random2=pd.DataFrame(np.random.randn(4,4), index=pd.date_range('20190804',periods=4), columns=list('ABCD'))
print(random2,'\n')

print('RESULT\n',random1+random2) # we can do any mathematical operation we want

                   A         B         C         D
2019-08-04  0.367024 -0.290965 -1.445863  0.356471
2019-08-05 -0.048152  0.584263  0.234378  1.187674
2019-08-06  1.087675  3.119710 -0.752859 -0.732167
2019-08-07 -1.272234  1.390921  0.354980 -3.013837
                   A         B         C         D
2019-08-04 -1.705893  0.625766  0.611229  0.783194
2019-08-05  1.298730 -0.136471 -0.122227 -0.299665
2019-08-06 -0.426789  1.935328  1.490682 -0.251480
2019-08-07 -1.410479 -0.239516 -1.806500  0.128395

RESULT
                    A         B         C         D
2019-08-04 -1.338869  0.334800 -0.834634  1.139665
2019-08-05  1.250578  0.447792  0.112151  0.888010
2019-08-06  0.660886  5.055038  0.737823 -0.983647
2019-08-07 -2.682714  1.151405 -1.451520 -2.885442